'''
Библиотека работы с аппаратом нечеткой логики

Данная библиотека содержит ряд модулей, призванных обеспечить использование
нечеткой логики в экономико-математическом моделировании. Она включает
следующие разделы: - различные носители нечетких подмножеств: от
действительного интервала до иерархических структур - нечеткие подмножества:
арифметические, логические операции - нечеткие числа, нечеткая арифметика -
нечеткие множества, классификаторы - нечеткий логический вывод, нечеткие
контроллеры - метод анализа иерархий
'''

import fuzzycalc.domain
import fuzzycalc.numbers
import fuzzycalc.set
import fuzzycalc.subset
import fuzzycalc.tnorm
import fuzzycalc.algebra
